sdaiValidateGlobalRule(Sdai_instS*,Sdai_instS*,Sdai_Id_aggr*)
\details
Checks the constraint (Global-Rule) for the schema instance.
\param schemaInstance [in] A schema instance.
\param rule           [in] A global rule to be validated.
\param list           [out] An identifier of a pre-existing NPL that stores the list of Where Rules associated with the Global Rule which were violated.
\returns sdaiTRUE if the global rule is satisfied; sdaiFALSE if the global rule is violated or sdaiUNKNOWN if the global rule is not implemented or an error has happened.